'use strict';
/*
===============================================================
Task #1
===============================================================
*/

let tC = prompt('Enter the Celsius temperature °C'),
    tF = Math.floor(((9 / 5) * tC + 32) * 100) / 100;

alert(`The Fahrenheit temperature is ${tF} F`);

/*
===============================================================
Task #2
===============================================================
*/

let name = 'Василий',
    admin = name;

console.log(`Admin's name is ${admin}`);
alert(`Admin's name is ${admin}`);

/*
===============================================================
Task #3
===============================================================
*/

/* выражение 1000 + '108' будет равно '1000108', так как при
   конкатенации числа со строкой, JS превращает число в строку.
   На выходе получаем строку.
*/

/*
===============================================================
Task #4
===============================================================
*/

/*

*/
